experiments/opengauss/huawei7/validation/model_calibration_20260824/sysbench-default-vs-recommended-20260826/default-r1.sysbench.log
sysbench 1.0.18 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 128 tps: 487.37 qps: 9203.05 (r/w/o: 8100.48/0.00/1102.57) lat (ms,95%): 520.62 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 128 tps: 785.12 qps: 12435.93 (r/w/o: 10865.69/0.00/1570.24) lat (ms,95%): 458.96 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 128 tps: 865.01 qps: 13901.21 (r/w/o: 12171.18/0.00/1730.03) lat (ms,95%): 419.45 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 128 tps: 1049.97 qps: 16833.55 (r/w/o: 14733.61/0.00/2099.94) lat (ms,95%): 376.49 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 128 tps: 1239.80 qps: 19795.87 (r/w/o: 17316.26/0.00/2479.61) lat (ms,95%): 320.17 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 128 tps: 1470.31 qps: 23454.90 (r/w/o: 20514.28/0.00/2940.61) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 128 tps: 1848.97 qps: 29514.55 (r/w/o: 25816.60/0.00/3697.94) lat (ms,95%): 227.40 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 128 tps: 2185.62 qps: 35076.98 (r/w/o: 30705.73/0.00/4371.25) lat (ms,95%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 128 tps: 2725.47 qps: 43533.58 (r/w/o: 38082.63/0.00/5450.95) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 128 tps: 3651.38 qps: 58385.02 (r/w/o: 51082.27/0.00/7302.75) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 128 tps: 4559.94 qps: 73105.08 (r/w/o: 63985.19/0.00/9119.88) lat (ms,95%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 128 tps: 6760.91 qps: 108146.54 (r/w/o: 94630.72/0.00/13515.82) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 128 tps: 7390.15 qps: 118369.37 (r/w/o: 103585.08/0.00/14784.30) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 128 tps: 7224.98 qps: 115640.75 (r/w/o: 101190.78/0.00/14449.97) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 128 tps: 7129.92 qps: 113969.66 (r/w/o: 99711.83/0.00/14257.83) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 128 tps: 6963.94 qps: 111491.09 (r/w/o: 97564.20/0.00/13926.89) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 128 tps: 7695.76 qps: 123127.23 (r/w/o: 107733.70/0.00/15393.53) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 128 tps: 7653.36 qps: 122484.78 (r/w/o: 107179.06/0.00/15305.72) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 128 tps: 7720.99 qps: 123454.86 (r/w/o: 108011.88/0.00/15442.98) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 7543.83 qps: 120769.21 (r/w/o: 105681.56/0.00/15087.65) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 128 tps: 7513.27 qps: 120184.28 (r/w/o: 105159.75/0.00/15024.54) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 128 tps: 7258.90 qps: 116214.46 (r/w/o: 101697.65/0.00/14516.81) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 128 tps: 7094.70 qps: 113539.12 (r/w/o: 99346.73/0.00/14192.39) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 128 tps: 6895.39 qps: 110257.23 (r/w/o: 96463.45/0.00/13793.78) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 128 tps: 7641.95 qps: 122294.19 (r/w/o: 107015.29/0.00/15278.90) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 128 tps: 7719.04 qps: 123480.61 (r/w/o: 108040.53/0.00/15440.08) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 128 tps: 7765.92 qps: 124216.64 (r/w/o: 108685.81/0.00/15530.83) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 128 tps: 7551.85 qps: 120808.58 (r/w/o: 105704.88/0.00/15103.70) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 128 tps: 7401.99 qps: 118468.88 (r/w/o: 103664.89/0.00/14803.98) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 7238.23 qps: 115883.73 (r/w/o: 101404.27/0.00/14479.47) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 128 tps: 7137.97 qps: 114207.46 (r/w/o: 99932.53/0.00/14274.93) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 128 tps: 6958.88 qps: 111335.15 (r/w/o: 97417.38/0.00/13917.77) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 128 tps: 7552.99 qps: 120851.85 (r/w/o: 105744.87/0.00/15106.98) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 128 tps: 7711.09 qps: 123289.37 (r/w/o: 107870.20/0.00/15419.17) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 128 tps: 7638.60 qps: 122194.52 (r/w/o: 106915.33/0.00/15279.19) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 128 tps: 7530.21 qps: 120548.30 (r/w/o: 105487.88/0.00/15060.41) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 128 tps: 7481.95 qps: 119687.26 (r/w/o: 104722.35/0.00/14964.91) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 128 tps: 7274.24 qps: 116360.89 (r/w/o: 101815.41/0.00/14545.49) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 128 tps: 7097.05 qps: 113669.83 (r/w/o: 99473.73/0.00/14196.10) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 6908.89 qps: 110519.32 (r/w/o: 96702.53/0.00/13816.79) lat (ms,95%): 26.20 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 128 tps: 7393.08 qps: 118197.35 (r/w/o: 103412.18/0.00/14785.17) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 128 tps: 7659.96 qps: 122580.37 (r/w/o: 107258.45/0.00/15321.92) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 128 tps: 7671.16 qps: 122711.62 (r/w/o: 107372.29/0.00/15339.33) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 128 tps: 7496.82 qps: 119969.13 (r/w/o: 104972.49/0.00/14996.64) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 128 tps: 7426.00 qps: 118867.06 (r/w/o: 104015.05/0.00/14852.01) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 128 tps: 7274.04 qps: 116356.62 (r/w/o: 101808.55/0.00/14548.08) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 128 tps: 7056.89 qps: 112872.20 (r/w/o: 98761.42/0.00/14110.77) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 128 tps: 6942.11 qps: 111096.83 (r/w/o: 97208.60/0.00/13888.23) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 128 tps: 7473.95 qps: 119573.20 (r/w/o: 104627.30/0.00/14945.90) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 128 tps: 7741.05 qps: 123868.85 (r/w/o: 108388.74/0.00/15480.11) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 128 tps: 7708.62 qps: 123333.95 (r/w/o: 107916.71/0.00/15417.24) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 128 tps: 7430.02 qps: 118904.39 (r/w/o: 104048.34/0.00/14856.05) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 128 tps: 7416.18 qps: 118660.93 (r/w/o: 103823.56/0.00/14837.37) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 128 tps: 7242.77 qps: 115838.39 (r/w/o: 101352.84/0.00/14485.55) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 128 tps: 7075.31 qps: 113271.99 (r/w/o: 99121.37/0.00/14150.62) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 128 tps: 6984.03 qps: 111803.51 (r/w/o: 97832.44/0.00/13971.06) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 128 tps: 7542.93 qps: 120561.88 (r/w/o: 105479.02/0.00/15082.86) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 128 tps: 7683.03 qps: 123012.55 (r/w/o: 107646.48/0.00/15366.07) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 128 tps: 7703.13 qps: 123190.09 (r/w/o: 107783.83/0.00/15406.26) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 7501.91 qps: 120087.52 (r/w/o: 105082.71/0.00/15004.82) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 128 tps: 7442.06 qps: 118985.91 (r/w/o: 104102.80/0.00/14883.11) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 128 tps: 7303.82 qps: 116922.17 (r/w/o: 102313.52/0.00/14608.65) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 128 tps: 7142.01 qps: 114236.22 (r/w/o: 99956.20/0.00/14280.03) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 128 tps: 6934.93 qps: 110987.90 (r/w/o: 97114.04/0.00/13873.86) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 128 tps: 7518.12 qps: 120329.00 (r/w/o: 105293.75/0.00/15035.25) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 128 tps: 7726.76 qps: 123613.19 (r/w/o: 108156.66/0.00/15456.52) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 128 tps: 7678.15 qps: 122787.39 (r/w/o: 107433.09/0.00/15354.30) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 128 tps: 7519.83 qps: 120300.21 (r/w/o: 105265.56/0.00/15034.65) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 128 tps: 7478.39 qps: 119730.30 (r/w/o: 104768.52/0.00/14961.79) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 128 tps: 7253.07 qps: 116055.12 (r/w/o: 101549.98/0.00/14505.14) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 128 tps: 7155.87 qps: 114454.96 (r/w/o: 100141.22/0.00/14313.75) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 128 tps: 7016.09 qps: 112322.40 (r/w/o: 98292.23/0.00/14030.18) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 128 tps: 7478.80 qps: 119587.73 (r/w/o: 104631.14/0.00/14956.59) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 128 tps: 7712.14 qps: 123426.27 (r/w/o: 108000.98/0.00/15425.28) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 128 tps: 7726.94 qps: 123621.02 (r/w/o: 108169.15/0.00/15451.88) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 128 tps: 7532.91 qps: 120498.58 (r/w/o: 105429.76/0.00/15068.82) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 128 tps: 7515.15 qps: 120284.34 (r/w/o: 105254.05/0.00/15030.29) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 128 tps: 7343.91 qps: 117555.60 (r/w/o: 102868.78/0.00/14686.83) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 128 tps: 7164.17 qps: 114608.74 (r/w/o: 100279.40/0.00/14329.34) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 128 tps: 6938.06 qps: 111058.02 (r/w/o: 97182.89/0.00/13875.13) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            7426412
        write:                           0
        other:                           1060916
        total:                           8487328
    transactions:                        530458 (6627.90 per sec.)
    queries:                             8487328 (106046.37 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          80.0330s
    total number of events:              530458

Latency (ms):
         min:                                    1.36
         avg:                                   19.30
         max:                                  909.89
         95th percentile:                       21.89
         sum:                             10238786.29

Threads fairness:
    events (avg/stddev):           4144.2031/54.95
    execution time (avg/stddev):   79.9905/0.02